#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {23, 96, 3, 62, 59, 10, 73, 30, 10, 81},
        {44, 3, 99, 88, 53, 90, 42, 39, 36, 98},
        {39, 32, 5, 8, 34, 9, 39, 95, 36, 41},
        {33, 79, 22, 99, 29, 61, 65, 48, 70, 77},
        {73, 49, 40, 39, 16, 49, 68, 37, 60, 10},
        {98, 65, 67, 11, 14, 39, 74, 29, 70, 81},
        {29, 90, 63, 44, 5, 4, 5, 28, 22, 94},
        {88, 100, 15, 75, 42, 68, 50, 8, 98, 55},
        {38, 21, 77, 25, 91, 92, 64, 72, 16, 67},
        {65, 93, 45, 52, 51, 19, 96, 45, 7, 39}
    };
    // Вывод  матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
    // Сложение элементов по вертикали
    for (int i = 8; i >= 0; i--)
    {
        array[i][0] += array[i + 1][0];
    }
    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[9][j] += array[9][j - 1];
    }
    // Сложение элементов по диагонали
    for (int i = 8; i >= 0; i--)
    {
        for (int j = 1; j < 10; j++)
        {
            int maxElement = max(array[i][j-1], array[i+1][j]);
            array[i][j] += maxElement;
        }
    }
    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
}

/*#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {23, 96, 3, 62, 59, 10, 73, 30, 10, 81},
        {44, 3, 99, 88, 53, 90, 42, 39, 36, 98},
        {39, 32, 5, 8, 34, 9, 39, 95, 36, 41},
        {33, 79, 22, 99, 29, 61, 65, 48, 70, 77},
        {73, 49, 40, 39, 16, 49, 68, 37, 60, 10},
        {98, 65, 67, 11, 14, 39, 74, 29, 70, 81},
        {29, 90, 63, 44, 5, 4, 5, 28, 22, 94},
        {88, 100, 15, 75, 42, 68, 50, 8, 98, 55},
        {38, 21, 77, 25, 91, 92, 64, 72, 16, 67},
        {65, 93, 45, 52, 51, 19, 96, 45, 7, 39}
    };
    // Вывод  матрицы
    cout << "Исходная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
    // Сложение элементов по вертикали
    for (int i = 8; i >= 0; i--)
    {
        array[i][0] += array[i + 1][0];
    }
    // Сложение элементов по горизонтали
    for (int j = 1; j < 10; j++)
    {
        array[9][j] += array[9][j - 1];
    }
    // Сложение элементов по диагонали
    for (int i = 8; i >= 0; i--)
    {
        for (int j = 1; j < 10; j++)
        {
            int minElement = min(array[i][j-1], array[i+1][j]);
            array[i][j] += minElement;
        }
    }
    // Вывод измененной матрицы
    cout << endl << "Измененная таблица:" << endl;
    for (int i = 0; i < 10; i++)
    {
        for (int j = 0; j < 10; j++)
        {
            cout << array[i][j] << " ";
        }
        cout << endl;
    }
}*/
